[
  {
    "name": "News: Thousands march outside COP30 summit in call for action",
    "body": "{\n  \"title\": \"Thousands march outside COP30 summit in call for action\",\n  \"source\": \"https://www.bbc.com/news/articles/cy40z22qqwwo?at_medium=RSS&at_campaign=rss\",\n  \"published_date\": \"Sat, 15 Nov 2025 17:09:03 GMT\",\n  \"summary\": \"This is the first time since 2021 that protesters have been allowed to demonstrate outside the UN talks.\",\n  \"content\": \"Thousands march outside COP30 summit in call for action\\n\\n1 hour ago\\n\\nGeorgina RannardClimate and science reporter, Bel\\u00e9m, Brazil\\n\\nMarching to the beat of pounding sound systems, thousands of climate protesters have been bringing their message to the gates of the COP30 climate talks in Brazil.\\n\\nChanting and singing \\\"free the Amazon\\\", demonstrators in host city Bel\\u00e9m have been carrying three giant coffins reading Oil, Coal and Gas flanked by two grim reapers.\\n\\nIndigenous groups displayed signs reading \\\"the answer is us\\\" as an inflatable elephant and anaconda weaved through the crowd under the hot sun.\\n\\nIt is the first time since 2021 that protesters have been allowed to demonstrate outside the UN climate talks. The last three took place in countries that do not permit public protest.\\n\\n\\\"We are holding a funeral for fossil fuels,\\\" Tuga C\\u00edntia told the BBC. She is from the theatre group Hydra Dance from the Federal University of Par\\u00e1.\\n\\n\\\"I'm here because enough is enough with COP meetings and theory. It's time for us to actually act,\\\" she said.\\n\\nIndigenous communities, Brazilian youth groups, and activists from across the world joined the march in their thousands.\\n\\nAs the midday sun intensified, some sought shelter in a petrol station forecourt.\\n\\n\\\"Fossil fuels are still being burned. We know all too well what it's like to live on the frontline of climate change,\\\" Brianna Fruean, a climate activist from Samoa, a low-lying island extremely vulnerable to climate change, told the BBC.\\n\\n\\\"We are here after so many COPS, marching for justice, for the end of fossil fuels,\\\" Ilan, from the non-governmental organisation 350, who lives in Brazil, said.\\n\\nSome carried signs reading \\\"demarcation now\\\", calling for indigenous groups to be given legal ownership of their territories.\\n\\nHundreds of indigenous groups live in the Amazon and are regarded by experts as the best protectors of biodiversity and forests.\\n\\nSmaller sister protests have taken place around the world including in the UK.\\n\\nSecurity was tight at the COP30 venue as police with riot shields guarded the entrance.\\n\\nOn Tuesday protesters carrying signs broke through security lines at the summit. The incident caused minor injuries to two security staff and some limited damage to the venue.\\n\\nRepresentation of indigenous voices has been a flashpoint in these talks, some of whom have set up stalls outside the fenced-off COP30 venue to sell products to passing delegates.\\n\\nThe meeting was dubbed the \\\"indigenous people's COP\\\" but many groups feel their concerns over deforestation, land protection and resource extraction in their homes are not being heard.\\n\\nNegotiations continued at the COP30 talks on Saturday. Nearly 200 countries are meeting to try to make progress on tackling climate change.\\n\\nLittle progress was made in the first week of the talks, although some delegations say they are pushing for an agreed strategy to deliver on past promises to move away from using planet-warming fossil fuels.\\n\\nPresident Luis I\"\n}",
    "source_type": "json",
    "article_index": 0
  },
  {
    "name": "News: Pope Leo welcomes Hollywood stars to the Vatican",
    "body": "{\n  \"title\": \"Pope Leo welcomes Hollywood stars to the Vatican\",\n  \"source\": \"https://www.bbc.com/news/articles/cdxr5drrpqxo?at_medium=RSS&at_campaign=rss\",\n  \"published_date\": \"Sat, 15 Nov 2025 16:06:45 GMT\",\n  \"summary\": \"Pope Leo spoke to stars including Cate Blanchett, Spike Lee and Viggo Mortensen at the event for global cinema.\",\n  \"content\": \"Pope Leo welcomes Hollywood stars to the Vatican\\n\\n2 hours ago\\n\\nSarah RainsfordSouthern and Eastern Europe correspondent, Rome\\n\\nPope Leo has held an audience with Hollywood stars, urging actors and directors including Cate Blanchett, Viggo Mortensen and Monica Bellucci to continue their work as \\\"pilgrims of the imagination\\\", helping to \\\"bring hope\\\".\\n\\nThe celebrity meeting was a sprinkling of star dust for a still relatively new pope and a way for the Catholic Church to engage more with the world beyond.\\n\\nIt was also a strong show of support from Leo XIV for the global film industry, as he spoke out against the \\\"troubling decline\\\" in cinema-going.\\n\\nHailed by director Spike Lee as a \\\"great day\\\", the gathering was the first of its kind in the Vatican.\\n\\nBeneath the magnificent frescoes of the Clementine Hall, Pope Leo spoke in Italian to praise the power of cinema to entertain and to educate \\u2013 and for its \\\"capacity to amaze\\\".\\n\\nBut he urged filmmakers not to shy away from what he called \\\"the world's wounds\\\".\\n\\n\\\"Violence, poverty, exile, loneliness, addiction and forgotten wars are issues that need to be acknowledged and narrated,\\\" the Pope said. \\\"Good cinema does not exploit pain; it recognizes and explores it. This is what all the great directors have done.\\\"\\n\\nSix months since a conclave of cardinals elected the first North American to the Papacy, some Catholics feel that Leo has been slow to stamp his own mark on the role.\\n\\nHis predecessor, Francis, was a charismatic Argentinian known for his off-the-cuff comments and dramatic gestures. Leo's style is far quieter, so this star-studded engagement is a new look.\\n\\nIt's not clear how the cast list was drawn up, although none of the directors in the hall \\u2013 who came from all over the world \\u2013 made it onto the Pope's own top film list.\\n\\nThis week, the Vatican revealed that his favourite four watches of all time included the 1960s nun-themed classic The Sound of Music, It's a Wonderful Life and Italian Roberto Benigni's multi award-winning Life is Beautiful.\\n\\nAmong those who did join today's A-list audience were Mortensen, Chris Pine and filmmaker Gus Van Sant \\u2013 of Milk and Good Will Hunting fame. The large Italian contingent included Gianni Amelio and Cinema Paradiso creator, Giuseppe Tornatore.\\n\\nAt a time of immense pressure on film, not long after a major Hollywood strike and with funding strains here in Italy, the Pope spoke in defence of the industry.\\n\\nHe was applauded loudly when he talked of the \\\"quiet dedication\\\" of all those behind the scenes with vital roles.\\n\\nHe also warned against the closure of cinemas which he characterised as the \\\"beating heart of communities\\\".\\n\\n\\\"More than a few people are saying that the art of cinema and the cinematic experience are in danger. I urge institutions not to give up, but to cooperate in affirming the social and cultural value of this activity,\\\" the Pope said.\\n\\nAfter a fifteen-minute speech and a blessing he then received each audience member in turn, led by Blanchet\"\n}",
    "source_type": "json",
    "article_index": 1
  },
  {
    "name": "News: Epstein files: Who else was mentioned?",
    "body": "{\n  \"title\": \"Epstein files: Who else was mentioned?\",\n  \"source\": \"https://www.bbc.com/news/articles/cn09n94qg92o?at_medium=RSS&at_campaign=rss\",\n  \"published_date\": \"Sat, 15 Nov 2025 14:23:11 GMT\",\n  \"summary\": \"Michael Wolff, Larry Summers, Peter Thiel - who are some of the other names mentioned in the newly released files?\",\n  \"content\": \"Epstein files: Who else was mentioned?\\n\\n4 hours ago\\n\\nPaulin Kola and Kayla Epstein\\n\\nUS lawmakers have released more than 20,000 pages of documents from the estate of the disgraced financier and convicted late sex offender Jeffrey Epstein.\\n\\nSome of the documents mention Andrew Mountbatten Windsor, the former prince and brother of King Charles; US President Donald Trump; Trump's former advisor Steve Bannon; and a cast of other characters from the world of media, politics and entertainment, who highlight the extent of Epstein's contact book.\\n\\nTrump was a friend of Epstein's for years, but the president has said they fell out in about 2004, years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein.\\n\\nHere are some of the the other names that came up, which does not indicate wrongdoing by any of the parties mentioned.\\n\\nMichael Wolff\\n\\nMichael Wolff, 72, is an American journalist and columnist - as well as a prolific author of books on the wealthy and the famous.\\n\\nFire and Fury, the first of several books spanning Trump's first stint as US president, came out in 2018, with descriptions of a dysfunctional White House and salacious details about the US commander-in-chief. Trump said it was \\\"full of lies\\\".\\n\\nThe new batch of files related to Jeffrey Epstein shed light on a relationship that appears to indicate a correspondence between Wolff and the late convicted sex offender.\\n\\nAttention has focused particularly on one of the emails, in which Wolff appears to give Epstein advice in relation to Trump, as Trump was campaigning for the White House for the first time.\\n\\nWolff wrote to Epstein in 2015 to notify him that CNN was planning to ask Trump, as a presidential candidate, about his relationship with Epstein.\\n\\nEpstein replied: \\\"If we were able to craft an answer for him, what do you think it should be?\\\"\\n\\nThe two go on to discuss a strategy, with Wolff writing: \\\"I think you should let him hang himself.\\\"\\n\\nIn a separate email from October 2016, days before the US presidential election, Wolff offers Epstein a chance to sit for an interview that could \\\"finish\\\" Trump.\\n\\nResponding to the release in a video posted to Instagram, Wolff said: \\\"Some of those emails are between Epstein and me, with Epstein discussing his relationship with Donald Trump.\\\"\\n\\n\\\"I have been trying to talk about this story for a very long time now,\\\" he added.\\n\\nIn fact, Wolff disclosed before the latest presidential election in the US that he had interviewed Epstein \\\"periodically\\\" for Fire and Fury - and released tapes of those conversations.\\n\\nLarry Summers\\n\\nThe documents include correspondences between Epstein and Larry Summers, who was former Democratic President Bill Clinton's Treasury Secretary. It had been previously reported that the two men knew each other.\\n\\nThe emails indicate the two met for dinner frequently, with Epstein often trying to connect Summers to prominent global figures. At one point, in July 2018, Epstein proposed a meeting \"\n}",
    "source_type": "json",
    "article_index": 2
  },
  {
    "name": "News: DR Congo and M23 rebels sign framework for peace in Qatar",
    "body": "{\n  \"title\": \"DR Congo and M23 rebels sign framework for peace in Qatar\",\n  \"source\": \"https://www.bbc.com/news/articles/cwy7zlngwepo?at_medium=RSS&at_campaign=rss\",\n  \"published_date\": \"Sat, 15 Nov 2025 17:12:16 GMT\",\n  \"summary\": \"Building on previous deals it covers humanitarian access, the return of displaced people and more.\",\n  \"content\": \"DR Congo and M23 rebels sign framework for peace in Qatar\\n\\nRwandan-backed M23 rebels and the government of the Democratic Republic of Congo have signed a framework for peace in the east of the country.\\n\\nThe ceremony was held in Qatar, which along with the US and the African Union, has been trying to mediate an end to decades of conflict in the resource-rich region.\\n\\nEarlier this year, the M23 captured the eastern region's main cities of Goma and Bukavu. Previous attempts to secure peace have failed.\\n\\nThe US's Africa envoy Massad Boulos said the document covered eight protocols and that most still required work. He also acknowledged that prisoner exchanges and ceasefire monitoring had been slower than originally hoped.\\n\\nKinshasa is demanding the withdrawal of Rwandan troops from its territory.\\n\\nKigali says this can happen once the Congo-based FDLR rebel militia is disbanded. It is largely made up of ethnic Hutus linked to the 1994 Rwandan genocide.\\n\\nThe new framework also addresses humanitarian access, the return of displaced people and protection of the judiciary, Boulous is quoted as saying by the AFP agency.\\n\\nIt builds on a declaration of principles signed by the two sides in Doha in July, as well as a deal made in the same city last month on the monitoring of an eventual ceasefire.\\n\\nBefore that, in June, talks between Rwanda and DR Congo brokered by Washington resulted in the signing of a peace deal that was hailed by US President Donald Trump as a \\\"a glorious triumph\\\" but was swiftly violated by the warring parties.\\n\\nThe M23 is one of the biggest parties in this conflict, but was not directly involved in the US-brokered ceasefire deal. It has always favoured the talks mediated by Qatar, saying they will address \\\"the root causes\\\" of the conflict.\\n\\nDecades of conflict escalated in January when M23 rebels seized control of large parts of eastern DR Congo including the regional capital, Goma, the city of Bukavu and two airports.\\n\\nSince January, thousands of people have been killed and hundreds of thousands of civilians forced from their homes.\\n\\nAfter the loss of territory, the government in Kinshasa had turned to the US for help, reportedly offering access to critical minerals in exchange for security guarantees. Eastern DR Congo is rich in coltan and other resources vital to the global electronics industries.\\n\\nRwanda denies supporting the M23, despite overwhelming evidence, and insists its military presence in the region is a defensive measure against threats posed by armed groups like the FDLR.\"\n}",
    "source_type": "json",
    "article_index": 3
  },
  {
    "name": "News: On a Clipped Wing, Flamingo Escapes a British Zoo for a Life in France",
    "body": "{\n  \"title\": \"On a Clipped Wing, Flamingo Escapes a British Zoo for a Life in France\",\n  \"source\": \"https://www.nytimes.com/2025/11/15/world/europe/flamingo-zoo-escape-britain-france.html\",\n  \"published_date\": \"Sat, 15 Nov 2025 16:00:16 +0000\",\n  \"summary\": \"Frankie, a young Caribbean Flamingo, flew 130 miles from captivity. Her keepers said they would likely have to leave her in France.\",\n  \"content\": \"On a Clipped Wing, Flamingo Escapes a British Zoo for a Life in France\\n\\nAs the weather turned cool this autumn across England, Frankie the flamingo had apparently had enough.\\n\\nOn a blustery Sunday morning this month, the juvenile bird vanished from the zoo in Cornwall where she was born. After a frantic six-day search to find her, Frankie's keepers learned this week that she had traveled roughly 130 miles away \\u2014 to a beach in France.\\n\\nFrankie's journey was exceptional, her keepers said, as she is only a few months old and had a wing clipped, which should have prevented her from ever taking flight.\\n\\n\\\"Being a young bird, we were quite surprised how quickly she got to France,\\\" said David Woolcock, a curator at the Paradise Park Wildlife Sanctuary, where Frankie lived. \\\"But she's feeding, she's preening, she's having a whale of a time by the look of it.\\\"\\n\\nFrankie, a four-month-old Caribbean Flamingo whom Mr. Woolcock described as \\\"aloof\\\" and \\\"quite a character,\\\" left the zoo sometime around 8 a.m. on Nov. 2, when a staff member noticed she was missing from her flock.\\n\\nThe details of her escape are still a mystery, but Mr. Woolcock offered a theory: Like most young birds, flamingos are known to jump up and down, stretching and flapping their wings as they get used to them, he said.\\n\\n\\\"I suspect that what happened was she was in the process of doing that and a gust of wind took her and she was up and away,\\\" he said.\\n\\nClipping a bird's wing can prevent it from taking flight, he added, but it does not prevent them from flying once airborne.\\n\\nAfter she was reported missing, the zoo contacted local news media, asking for the public's help in finding her.\\n\\nHer keepers followed up on tips across the region, a process that was complicated by the recent release of a White Stork by a conservation group farther north.\\n\\n\\\"We were getting constant calls \\u2014 'We found the flamingo, it's here in this field,'\\\" Mr. Woolcock said. \\\"We would drive out there, and it would be the White Stork.\\\"\\n\\nThere was only a single confirmed sighting of Frankie in England \\u2014 a local resident's grainy photo of her high in the air \\u2014 before the trail went cold. The staff worried that she might have hit an air stream that pulled her far out into the Atlantic Ocean.\\n\\nA breakthrough came on Nov. 9, when a sighting appeared on a French citizen science portal: A flamingo on the \\u00cele Aganton, an island on the north coast of France. A pair of images of a flamingo along the coast at Plage de Keremma, about 30 miles away, were later forwarded to the zoo.\\n\\nThe sighting on \\u00cele Aganton was made on Nov. 3, shortly before 10 a.m., which means Frankie could have made it to France in less than a day.\\n\\nNow that she's there, the zoo said it was unlikely it would be able to bring her home.\\n\\nThe United Kingdom's departure from the European Union has made it difficult to move wild animals across the U.K.-France border. An extra complication, Mr. Woolcock said, was the risk that Frankie may have contracted bird flu \"\n}",
    "source_type": "json",
    "article_index": 4
  },
  {
    "name": "News: Trump pressures Thailand to recommit to Cambodia ceasefire with ‘threat of tarif",
    "body": "{\n  \"title\": \"Trump pressures Thailand to recommit to Cambodia ceasefire with \\u2018threat of tariffs\\u2019\",\n  \"source\": \"https://www.theguardian.com/world/2025/nov/15/us-pressures-thailand-to-recommit-to-cambodia-ceasefire-with-threat-of-tariffs\",\n  \"published_date\": \"Sat, 15 Nov 2025 16:03:23 GMT\",\n  \"summary\": \"<p>Bangkok had earlier said it was suspending ceasefire, accusing Cambodia of laying landmines along the border</p><p>The US has put pressure on Thailand to recommit to a ceasefire with Cambodia, warning trade talks could be halted as Washington seeks to keep a Donald Trump-brokered truce agreement from falling apart.</p><p>Earlier this week, Thailand said that it was suspending the <a href=\\\"https://www.theguardian.com/us-news/2025/oct/26/trump-oversees-thailand-cambodia-ceasefire-signing-as-asia-tour-gets-under-way\\\">ceasefire deal</a>, accusing Cambodia of laying fresh landmines along the border, including one it said wounded a Thai soldier on patrol, who lost a foot in the explosion.</p> <a href=\\\"https://www.theguardian.com/world/2025/nov/15/us-pressures-thailand-to-recommit-to-cambodia-ceasefire-with-threat-of-tariffs\\\">Continue reading...</a>\",\n  \"content\": \"Trump pressures Thailand to recommit to Cambodia ceasefire with 'threat of tariffs'\\n\\nThe US has put pressure on Thailand to recommit to a ceasefire with Cambodia, warning trade talks could be halted as Washington seeks to keep a Donald Trump-brokered truce agreement from falling apart.\\n\\nEarlier this week, Thailand said that it was suspending the ceasefire deal, accusing Cambodia of laying fresh landmines along the border, including one it said wounded a Thai soldier on patrol, who lost a foot in the explosion.\\n\\nSince then, one person has been killed and several others wounded by gunfire along the Thai-Cambodia frontier, leading to concerns of a new round of tit-for-tat fighting.\\n\\nOn Saturday, Thai foreign ministry spokesperson Nikorndej Balankura told journalists that a letter from the Office of the US Trade Representative announcing the suspension of trade deal talks was received on Friday night.\\n\\nHe quoted the letter as saying trade negotiations \\u2013 which are addressing a US tariff of 19% \\u2013 could resume once Thailand reaffirmed its commitment to carrying out the joint ceasefire declaration.\\n\\nHowever, another government spokesperson, Siripong Angkasakulkiat, said later on Saturday that the temporary suspension occurred before a call between Thai prime minister Anutin Charnvirakul and Trump late on Friday.\\n\\n\\\"Tariff negotiations will continue and remain separate from border issues,\\\" Siripong said.\\n\\nAddressing reporters on Air Force One as he flew to Florida on Friday, Trump suggested that he had used the \\\"threat of tariffs\\\" in calls with the south-east Asian leaders.\\n\\nThe US president said, \\\"I stopped a war just today through the use of tariffs, the threat of tariffs,\\\" adding, \\\"they're doing great. I think they're gonna be fine.\\n\\nThai foreign ministry spokesperson Nikorndej said prime minister Anutin explained the matter to Trump on their call, \\\"who expressed understanding regarding the issue\\\".\\n\\nTrump oversaw the signing of a ceasefire agreement, held in Malaysia this October, and has touted it as one of several deals around the world he says should win him the Nobel Peace prize.\\n\\nThe worst fighting in a decade between Thai and Cambodian troops erupted in July, with gunfire, artillery and airstrikes leaving dozens of people killed and 300,000 displaced.\\n\\nThailand and Cambodia have a longstanding border dispute that dates back to disagreements over colonial-era maps drawn up by the French. Ancient temples along the border are claimed by both sides.\\n\\nReuters contributed to this report\"\n}",
    "source_type": "json",
    "article_index": 5
  },
  {
    "name": "News: Viktor Orbán begins ‘anti-war roadshow’ as Hungary gears up for 2026 elections",
    "body": "{\n  \"title\": \"Viktor Orb\\u00e1n begins \\u2018anti-war roadshow\\u2019 as Hungary gears up for 2026 elections\",\n  \"source\": \"https://www.theguardian.com/world/2025/nov/15/viktor-orban-hungary-2026-election-campaign-fidesz\",\n  \"published_date\": \"Sat, 15 Nov 2025 14:31:35 GMT\",\n  \"summary\": \"<p>PM makes opposition to support for Ukraine central to Fidesz campaign as it loses ground over cost of living crisis</p><p>Hungary\\u2019s prime minister has kicked off a weeks-long \\u201canti-war roadshow\\u201d, turning criticism of European support for Ukraine into an early campaign message before next year\\u2019s elections.</p><p>Viktor Orb\\u00e1n\\u2019 is scheduled to stage an event in five cities before the end of the year, and started with an assembly on Saturday in the north-western city of Gy\\u0151r.</p> <a href=\\\"https://www.theguardian.com/world/2025/nov/15/viktor-orban-hungary-2026-election-campaign-fidesz\\\">Continue reading...</a>\",\n  \"content\": \"Viktor Orb\\u00e1n begins 'anti-war roadshow' as Hungary gears up for 2026 elections\\n\\nHungary's prime minister has kicked off a weeks-long \\\"anti-war roadshow\\\", turning criticism of European support for Ukraine into an early campaign message before next year's elections.\\n\\nViktor Orb\\u00e1n' is scheduled to stage an event in five cities before the end of the year, and started with an assembly on Saturday in the north-western city of Gy\\u0151r.\\n\\n\\\"Those who want peace will join us,\\\" the rightwing leader of the Fidesz party said in a Facebook post before the event.\\n\\nThe series of rallies began a week after Orb\\u00e1n's visit to Washington DC, where he met Donald Trump, who agreed to grant Hungary a one-year exemption from US sanctions on importing oil and gas from Russia. The agreement was seen as a boost for Orb\\u00e1n, who has been in power for 15 years, during uncertain economic times for the country.\\n\\nAccording to insiders, another of Orb\\u00e1n's priorities for the trip was to persuade Trump to visit Hungary for a meeting with the Russian president, Vladimir Putin, with whom Orb\\u00e1n has maintained ties, despite anger from other European governments.\\n\\nThe Hungarian leader has repeatedly warned of the risks of an ever-spiralling war, and Orb\\u00e1n will be hoping the \\\"anti-war\\\" message can undercut his opposition before the elections, which are due to take place in April next year.\\n\\nBut P\\u00e9ter Magyar, a former Fidesz insider whose Tisza party is now leading in some independent polls, had organised another event in Gy\\u0151r on the same day. \\\"Fidesz is the party of war and hatred, while Tisza works for peace at home and around the world,\\\" he said in a Facebook post.\\n\\nOrb\\u00e1n has positioned himself as the voice of reason against what he says is a failed EU-led campaign to arm Ukraine. But his detractors at home and in the EU believe that the rightwing politician is too close to Putin and have called him the Kremlin's \\\"Trojan horse\\\" in the bloc.\\n\\nLast month, Orb\\u00e1n led a \\\"peace march\\\" in which he told thousands in the crowd that Hungary was \\\"the only country in Europe standing up for peace\\\".\\n\\nRelations between Budapest and Kyiv have deteriorated over Hungary blocking steps towards Ukraine's accession to the EU, as well as Orb\\u00e1n's refusal to impose sanctions on Russia.\\n\\nThe issue of Ukraine, which shares a border with Hungary, has regularly played into domestic politics. Pro-Fidesz media have accused Magyar of collaborating with the Ukrainian secret service, calling him \\\"the Hungarian Zelenskyy\\\".\\n\\nThis year, billboards have been erected in Hungary depicting a sinister-looking Volodymyr Zelenskyy, the Ukrainian president, alongside the European Commission's president, Ursula von der Leyen, with the caption: \\\"They would take Ukraine in the EU. We would pay the price.\\\"\\n\\nVlada, a 23-year-old Ukrainian woman living in Hungary, said: \\\"When families come here from the frontlines, where they've been under bombardment for years, these posters can trigger bad feelings again.\\\" She asked only to use her first \"\n}",
    "source_type": "json",
    "article_index": 6
  },
  {
    "name": "News: Two arrested over phone hidden in Commons to reportedly play sex noises during P",
    "body": "{\n  \"title\": \"Two arrested over phone hidden in Commons to reportedly play sex noises during PMQs\",\n  \"source\": \"https://www.theguardian.com/politics/2025/nov/15/two-arrested-over-phone-hidden-in-house-of-commons-to-play-sex-noises-during-pmqs\",\n  \"published_date\": \"Sat, 15 Nov 2025 16:37:00 GMT\",\n  \"summary\": \"<p>Police believe device was deliberately planted near frontbench to disrupt proceedings, prompting heightened security in parliament</p><p>Police have arrested two men in connection with a mobile phone hidden in the House of Commons that was reportedly planted there to play sex noises during prime minister\\u2019s questions.</p><p>The phone was found near the frontbench during a routine sweep of the chamber. It is believed to have been intended to interrupt the keynote weekly showdown between Keir Starmer and Kemi Badenoch in September.</p> <a href=\\\"https://www.theguardian.com/politics/2025/nov/15/two-arrested-over-phone-hidden-in-house-of-commons-to-play-sex-noises-during-pmqs\\\">Continue reading...</a>\",\n  \"content\": \"Two arrested over phone hidden in Commons to reportedly play sex noises during PMQs\\n\\nPolice have arrested two men in connection with a mobile phone hidden in the House of Commons that was reportedly planted there to play sex noises during prime minister's questions.\\n\\nThe phone was found near the frontbench during a routine sweep of the chamber. It is believed to have been intended to interrupt the keynote weekly showdown between Keir Starmer and Kemi Badenoch in September.\\n\\nThe police believe the phone was deliberately placed to cause disruption. A Metropolitan police spokesperson said: \\\"At 10.25 on Wednesday 3 September a mobile phone was found during a routine search of the House of Commons chamber by Met officers.\\n\\n\\\"Enquiries led officers to believe that the phone was purposely placed in a location with the aim of causing disruption to business in the house.\\n\\n\\\"A man in his 30s was arrested on Friday 5 September on suspicion of attempting to intentionally cause a public nuisance.\\n\\n\\\"Another man in his 60s was arrested on Tuesday 30 September on suspicion of the same offence. Both have been bailed to return at a later date.\\\"\\n\\nHeightened security measures were introduced in the Commons after the phone was found. Audio and guided tours were cancelled and there was reduced access to the Commons chamber.\\n\\nThe House of Lords took the same decision to reduce access to the Lords Chamber \\\"as a precautionary measure\\\".\\n\\n\\\"Enquiries remain ongoing and we continue to keep the speaker and clerk of the house up to date with our investigation,\\\" the spokesperson said.\\n\\nThe incident is being treated seriously as it represents a major breach of parliamentary security.\"\n}",
    "source_type": "json",
    "article_index": 7
  },
  {
    "name": "News: Nigel Farage is today’s Enoch Powell and his appeal down to slow economy, says m",
    "body": "{\n  \"title\": \"Nigel Farage is today\\u2019s Enoch Powell and his appeal down to slow economy, says minister\",\n  \"source\": \"https://www.theguardian.com/politics/2025/nov/15/nigel-farage-is-todays-enoch-powell-and-his-appeal-down-to-slow-economy-says-minister\",\n  \"published_date\": \"Sat, 15 Nov 2025 15:39:33 GMT\",\n  \"summary\": \"<p>Business secretary Peter Kyle says appeal of far-right parties like Reform due to \\u2018their dogma of disruption, division and despair\\u2019</p><p>Nigel Farage is \\u201ctoday\\u2019s incarnation of the politics of Enoch Powell\\u201d, the business secretary, Peter Kyle, said at the Co-operative party conference.</p><p>Kyle described Reform UK as \\u201cfar right\\u201d, while stressing that boosting economic growth was needed to \\u201cbuild an economy and a politics that people can trust to deliver for themselves, their families and their communities\\u201d.</p> <a href=\\\"https://www.theguardian.com/politics/2025/nov/15/nigel-farage-is-todays-enoch-powell-and-his-appeal-down-to-slow-economy-says-minister\\\">Continue reading...</a>\",\n  \"content\": \"Nigel Farage is today's Enoch Powell and his appeal down to slow economy, says minister\\n\\nNigel Farage is \\\"today's incarnation of the politics of Enoch Powell\\\", the business secretary, Peter Kyle, said at the Co-operative party conference.\\n\\nKyle described Reform UK as \\\"far right\\\", while stressing that boosting economic growth was needed to \\\"build an economy and a politics that people can trust to deliver for themselves, their families and their communities\\\".\\n\\nHe told the conference: \\\"The truth is that without securing higher, sustained economic growth, reconnecting people and politics, generating trust in the potential of democracy and importance of good government becomes almost impossible.\\n\\n\\\"And the appeal of the parties of the far right \\u2013 with their dogma of disruption, division and despair \\u2013 it becomes, too, alluring.\\\"\\n\\nKyle added: \\\"We see it today with Reform, just as we did in previous times with the National Front and the British National party.\\n\\n\\\"Lack of economic growth it is the cause. Nigel Farage, today's incarnation of the politics of Enoch Powell, is the effect.\\\"\\n\\nPowell made a speech widely remembered for the phrase \\\"rivers of blood\\\" in 1968, when he was a Conservative shadow minister, which was blamed for inflaming racial tensions at the time.\\n\\nIt comes days after Reform UK was accused of embracing racism after it picked a former academic who argued that UK-born people from minority ethnic backgrounds were not necessarily British as the head of its new student organisation.\\n\\nMatthew Goodwin, who is now a hard-right activist and prominent Reform supporter, posted on X that he believed even being born and brought up in the UK did not mean that people from black, Asian or other immigrant backgrounds were always British.\\n\\nEarlier this year, in response to Farage's opposition to the government's Online Safety Act, Kyle claimed people like Jimmy Savile would use the internet to exploit children if he was still alive. He insisted anyone against the act, such as Farage, was \\\"on their side\\\".\"\n}",
    "source_type": "json",
    "article_index": 8
  },
  {
    "name": "News: ‘Death by a thousand cuts’: the people who could face deportation under Reform",
    "body": "{\n  \"title\": \"\\u2018Death by a thousand cuts\\u2019: the people who could face deportation under Reform\",\n  \"source\": \"https://www.theguardian.com/uk-news/2025/nov/15/death-by-a-thousand-cuts-the-people-who-could-face-deportation-under-reform\",\n  \"published_date\": \"Sat, 15 Nov 2025 15:11:42 GMT\",\n  \"summary\": \"<p>As party\\u2019s rise fuels fears over future visa rules, people share how the lives they have built are in jeopardy</p><p>As Reform UK soars in the polls, Britain\\u2019s migrant communities are facing an uncertain future.</p><p>The party has announced a swathe of hardline immigration policies, including its plans to abolish indefinite leave to remain \\u2013 the right to settle permanently in the UK after five years of residence.</p> <a href=\\\"https://www.theguardian.com/uk-news/2025/nov/15/death-by-a-thousand-cuts-the-people-who-could-face-deportation-under-reform\\\">Continue reading...</a>\",\n  \"content\": \"'Death by a thousand cuts': the people who could face deportation under Reform\\n\\nAs Reform UK soars in the polls, Britain's migrant communities are facing an uncertain future.\\n\\nThe party has announced a swathe of hardline immigration policies, including its plans to abolish indefinite leave to remain \\u2013 the right to settle permanently in the UK after five years of residence.\\n\\nNigel Farage has said non-UK citizens would have to continue to apply for visas, with new higher salary thresholds. Although Reform has not specified what those thresholds would be, it is reported they could be set at about \\u00a360,000 a year \\u2013 far in excess of the \\u00a341,700 currently required for most skilled worker visas.\\n\\nSkilled worker visas come with restrictions and can be cancelled if a person leaves their employer, or if their salary changes.\\n\\nIn addition, the Labour government's plans to extend the indefinite leave to remain qualifying period to 10 years have been perceived as an attempt to claw back the support of voters who are considering backing Reform.\\n\\nHere, some people who have chosen to make the UK their home tell the Guardian how the lives they have built are now in jeopardy.\\n\\nJinnie Shin, 44, an emergency medicine doctor living in Bishop's Stortford, Hertfordshire\\n\\nShin, originally from the US, came to the UK as a medical student in 2015. She had barely left medical school when the NHS was paralysed by Covid. As a newly qualified doctor at Croydon university hospital, south London, she found herself battling to save the lives of those floored by the virus \\u2013 and comforting the dying as they said goodbye to their loved ones on video calls.\\n\\nFive years on, Shin, from Boston, is now an emergency medicine registrar at the Princess Alexandra hospital in Harlow, Essex. Despite the sacrifices she has made for the NHS \\u2013 she didn't see her family for 18 months while working 12-hour shifts treating patients on ventilators \\u2013 she wonders if she has a future in Britain.\\n\\nShin, 44, is now eligible for indefinite leave to remain. However, she has been left questioning whether it is worth paying the \\\"enormous\\\" costs \\u2013 application fees start at about \\u00a33,000 \\u2013 only for Reform to rescind settled status if they win the next general election.\\n\\nShe also worries that setting the salary thresholds for skilled worked visas at about \\u00a360,000 a year would devastate the NHS. A registrar beginning specialist training earns \\u00a352,656. The starting salary for a resident doctor \\u2013 formerly known as a junior doctor \\u2013 is \\u00a338,831.\\n\\n\\\"You are basically talking about culling [doctors] who will eventually become our registrars and consultants,\\\" Shin said. \\\"This sort of move would eliminate the foot soldiers of the NHS.\\\"\\n\\nShin maintains that she was \\\"fortunate\\\" to be able to help the health service navigate the worst crisis in its history in her first year as a doctor, but feels the toll it took on her and other immigrants \\u2013 about a fifth of the NHS workforce is from outside the UK \\u2013 may be forgotten.\\n\\n\\\"It w\"\n}",
    "source_type": "json",
    "article_index": 9
  }
]